docs/site/20231006104037-public_lecture.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Public Lecture</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Public Lecture</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgecb58f2">Public Lecture Overview</a>
<ul>
<li><a href="#orgb96120c">Brief introduction to meaning - 2 min</a></li>
<li><a href="#orgbd02ef9">Brief Historical Overview - 5 min</a></li>
<li><a href="#org081cf66">Difficulties - 5 min</a>
<ul>
<li><a href="#org52f5937">Setup - 1</a></li>
<li><a href="#org6a0587b">Technology -1</a></li>
<li><a href="#orgfb96306">Balance - 1</a></li>
<li><a href="#orge4dc307">Rehearsal - 1</a></li>
<li><a href="#org47be0cb">Importance of difficulty in music - 1</a></li>
</ul>
</li>
<li><a href="#orgc426f45">Benefits - 8 min</a>
<ul>
<li><a href="#orgc78c867">Improved Musicianship - 1</a></li>
<li><a href="#org75d2513">Transferrable Skills -1</a></li>
<li><a href="#orgee28714">Super Instrument - 1</a></li>
<li><a href="#org04ee0e8">Improvisation -1</a></li>
<li><a href="#org57abc4f">Freedom of expression - 1</a></li>
<li><a href="#org7628fef">Connect with audiences -2</a></li>
<li><a href="#orge0ca98d">Fun - 1</a></li>
</ul>
</li>
<li><a href="#orgcc897eb">Pedal Side - 10 min</a>
<ul>
<li><a href="#org7a7b854">How to hook up - 4</a></li>
<li><a href="#orgb0adea6">Demonstration of different effect types - 3</a></li>
<li><a href="#org7c06ba9">Example Literature - include maybe 30 second clips of portions with effects?  - 3 min</a></li>
</ul>
</li>
<li><a href="#orgec948d1">Computer Side -16 min</a>
<ul>
<li><a href="#org75fcd56">How to hook up - 5 min</a></li>
<li><a href="#org850084f">Software - 5 min</a></li>
<li><a href="#orgb231ba7">Performance Video Bassoonification?-  3 min</a></li>
<li><a href="#org7014634">Example literature - 30 second clips - video of screen? - 3 min</a></li>
</ul>
</li>
<li><a href="#org3960919">Curriculum Inclusion - 6 min</a>
<ul>
<li><a href="#org2458f84">Necessity for improved learning - 1 min</a></li>
<li><a href="#org8f58373">Examples in faculty or guest artists - 1 min</a></li>
<li><a href="#org77b0a51">Equipment to Purchase - 4min</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="20231106160228-lecture_draft.html#ID-C10F873F-B687-4C09-8E07-2AC7F7D70D75">lectureDraft</a>
</p>
<div id="outline-container-orgecb58f2" class="outline-2">
<h2 id="orgecb58f2">Public Lecture Overview</h2>
<div class="outline-text-2" id="text-orgecb58f2">
</div>
<div id="outline-container-orgb96120c" class="outline-3">
<h3 id="orgb96120c">Brief introduction to meaning - 2 min</h3>
</div>

<div id="outline-container-orgbd02ef9" class="outline-3">
<h3 id="orgbd02ef9">Brief Historical Overview - 5 min</h3>
</div>

<div id="outline-container-org081cf66" class="outline-3">
<h3 id="org081cf66">Difficulties - 5 min</h3>
<div class="outline-text-3" id="text-org081cf66">
</div>
<div id="outline-container-org52f5937" class="outline-4">
<h4 id="org52f5937">Setup - 1</h4>
</div>

<div id="outline-container-org6a0587b" class="outline-4">
<h4 id="org6a0587b">Technology -1</h4>
</div>

<div id="outline-container-orgfb96306" class="outline-4">
<h4 id="orgfb96306">Balance - 1</h4>
</div>

<div id="outline-container-orge4dc307" class="outline-4">
<h4 id="orge4dc307">Rehearsal - 1</h4>
</div>

<div id="outline-container-org47be0cb" class="outline-4">
<h4 id="org47be0cb">Importance of difficulty in music - 1</h4>
</div>
</div>
<div id="outline-container-orgc426f45" class="outline-3">
<h3 id="orgc426f45">Benefits - 8 min</h3>
<div class="outline-text-3" id="text-orgc426f45">
</div>
<div id="outline-container-orgc78c867" class="outline-4">
<h4 id="orgc78c867">Improved Musicianship - 1</h4>
</div>

<div id="outline-container-org75d2513" class="outline-4">
<h4 id="org75d2513">Transferrable Skills -1</h4>
</div>

<div id="outline-container-orgee28714" class="outline-4">
<h4 id="orgee28714">Super Instrument - 1</h4>
</div>

<div id="outline-container-org04ee0e8" class="outline-4">
<h4 id="org04ee0e8">Improvisation -1</h4>
</div>

<div id="outline-container-org57abc4f" class="outline-4">
<h4 id="org57abc4f">Freedom of expression - 1</h4>
</div>

<div id="outline-container-org7628fef" class="outline-4">
<h4 id="org7628fef">Connect with audiences -2</h4>
</div>

<div id="outline-container-orge0ca98d" class="outline-4">
<h4 id="orge0ca98d">Fun - 1</h4>
</div>
</div>
<div id="outline-container-orgcc897eb" class="outline-3">
<h3 id="orgcc897eb">Pedal Side - 10 min</h3>
<div class="outline-text-3" id="text-orgcc897eb">
</div>
<div id="outline-container-org7a7b854" class="outline-4">
<h4 id="org7a7b854">How to hook up - 4</h4>
</div>

<div id="outline-container-orgb0adea6" class="outline-4">
<h4 id="orgb0adea6">Demonstration of different effect types - 3</h4>
<div class="outline-text-4" id="text-orgb0adea6">
</div>
<ul class="org-ul">
<li><a id="orgef27e10"></a>Use a separate piece? a loop? excerpts for each one?<br />
<ul class="org-ul">
<li><a id="org9463ff4"></a>I think a loop could be good. It shows just the difference in each of the effects<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org7c06ba9" class="outline-4">
<h4 id="org7c06ba9">Example Literature - include maybe 30 second clips of portions with effects?  - 3 min</h4>
<div class="outline-text-4" id="text-org7c06ba9">
</div>
<ul class="org-ul">
<li><a id="org1fa1159"></a>Black Lion<br /></li>

<li><a id="org3633e43"></a>Fort Greene<br /></li>

<li><a id="orga4e32a8"></a>Electrically Tragic<br /></li>

<li><a id="org5cafbe1"></a>Perfectly Logical<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgec948d1" class="outline-3">
<h3 id="orgec948d1">Computer Side -16 min</h3>
<div class="outline-text-3" id="text-orgec948d1">
</div>
<div id="outline-container-org75fcd56" class="outline-4">
<h4 id="org75fcd56">How to hook up - 5 min</h4>
<div class="outline-text-4" id="text-org75fcd56">
</div>
<ul class="org-ul">
<li><a id="orgfac57df"></a>Pickup vs mics?<br /></li>
</ul>
</div>
<div id="outline-container-org850084f" class="outline-4">
<h4 id="org850084f">Software - 5 min</h4>
<div class="outline-text-4" id="text-org850084f">
</div>
<ul class="org-ul">
<li><a id="orge108e69"></a>Max/MSP<br />
<ul class="org-ul">
<li><a id="org18bb00e"></a>Video of opening and starting different max patches?<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgb231ba7" class="outline-4">
<h4 id="orgb231ba7">Performance Video Bassoonification?-  3 min</h4>
<div class="outline-text-4" id="text-orgb231ba7">
</div>
<ul class="org-ul">
<li><a id="org5edb505"></a>Pedal view in a corner, max view in another, score across the top?<br /></li>
</ul>
</div>
<div id="outline-container-org7014634" class="outline-4">
<h4 id="org7014634">Example literature - 30 second clips - video of screen? - 3 min</h4>
<div class="outline-text-4" id="text-org7014634">
</div>
<ul class="org-ul">
<li><a id="orge0ec7d1"></a>Shoot the Well<br /></li>

<li><a id="org6015674"></a>Brown Velvet<br /></li>

<li><a id="org97bbfd4"></a>Gnarkill<br /></li>

<li><a id="org656e69e"></a>Mask<br /></li>

<li><a id="org18ed026"></a>Reaction, Reflection<br /></li>

<li><a id="orgc27cebb"></a>Concatenation?<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org3960919" class="outline-3">
<h3 id="org3960919">Curriculum Inclusion - 6 min</h3>
<div class="outline-text-3" id="text-org3960919">
</div>
<div id="outline-container-org2458f84" class="outline-4">
<h4 id="org2458f84">Necessity for improved learning - 1 min</h4>
</div>

<div id="outline-container-org8f58373" class="outline-4">
<h4 id="org8f58373">Examples in faculty or guest artists - 1 min</h4>
</div>

<div id="outline-container-org77b0a51" class="outline-4">
<h4 id="org77b0a51">Equipment to Purchase - 4min</h4>
<div class="outline-text-4" id="text-org77b0a51">
</div>
<ul class="org-ul">
<li><a id="org62ddb5b"></a>Pedals<br /></li>

<li><a id="org90bb030"></a>Computers<br /></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
